#+PROPERTY: header-args    :tangle yes :comments link
** Add a link type for internal canvas links
:PROPERTIES:
:ID:       078cb4eb-cc8a-4583-99c4-16a105fd89a9
:END:
#+begin_src emacs-lisp
;;; ol-canvas.el - Support for links to man pages in Org mode
(require 'ol)

(org-link-set-parameters "canvas"
                         ;;:follow #'org-canvas-open
                         :follow #'org-id-open
                         :export #'org-canvas-export
                         :store #'org-canvas-store-link)

(defcustom org-canvas-command 'canvas
  "The Emacs command to be used to display a canvas page."
  :group 'org-link
  :type '(choice (const man) (const woman)))

(defun org-canvas-open (path _)
  "Visit the canvas page on PATH.
PATH should be a topic that can be thrown at the man command."
  (browse-url path)
  ;; (funcall org-canvas-command path)
  )
;; old version
(defun org-canvas-get-url (id _)
  (save-window-excursion
    ;; add widen to it
    ;;(org-id-open id _)
    (let ((m (org-id-find id 'marker)))
      (unless m
        (error "Cannot find entry with ID \"%s\"" id))
      (pop-to-buffer-same-window (marker-buffer m))
      (save-restriction
        (widen)
        (goto-char m)
        (move-marker m nil)
        (org-show-context)
        (org-id-goto id)
        (or
         (org-entry-get nil "CANVAS_HTML_URL")
         (org-entry-get nil "ORG_LMS_PREVIEW_URL")
         (org-entry-get nil "ORG_LMS_ANNOUNCEMENT_URL")
         (org-entry-get nil "MODULE_ITEM_EXTERNAL_URL"))))))


(defun org-canvas-store-link ()
  "Store a link to the current entry, using its ID .

If before first heading store first title-keyword as description
or filename if no title."
  (interactive)
  (when (and (buffer-file-name (buffer-base-buffer)) (derived-mode-p 'org-mode)
             (and (symbolp 'org-lms-mode) (symbol-value 'org-lms-mode )))
    (let* ((link (concat "canvas:" (org-id-get-create)))
	   (case-fold-search nil)

	   (desc (save-excursion
		   (org-back-to-heading-or-point-min t)
                   (cond ((org-before-first-heading-p)
                          (let ((keywords (org-collect-keywords '("TITLE"))))
                            (if keywords
                                (cadr (assoc "TITLE" keywords))
                              (file-name-nondirectory
			       (buffer-file-name (buffer-base-buffer))))))
		         ((looking-at org-complex-heading-regexp)
			  (if (match-end 4)
			      (match-string 4)
			    (match-string 0)))
                         (t link)))))
      (org-link-store-props :link link :description desc :type "canvas")
      link)))



(defun org-canvas-export (link description format &optional _)
  "Export a canvas page link from Org files."
  (let ((path (org-canvas-get-url link _))
        (desc (or description link)))
    (pcase format
      ('html (if path
                 (format "<a target=\"_blank\" href=\"%s\">%s</a>" path desc)
               desc))
      ('latex (if path
                  (format "\\href{%s}{%s}" path desc)
                des))
      ('texinfo (if path
                    (format "@uref{%s,%s}" path desc)
                  desc))
      ('ascii (if path
                  (format "%s (%s)" desc path)
                desc))
      (t desc))))




#+end_src

#+RESULTS:
: org-canvas-export

[[id:]]
#+begin_src emacs-lisp :tangle nil :raw
(org-canvas-export "b14b684e-7fa8-4dd6-abed-8ce66b4d0ff2" "some link" 'canvas-html)
#+end_src

#+RESULTS:
: <a target="_blank" href="https://q.utoronto.ca/courses/233877/pages/reflection-02-handout-and-preliminary-exercises">some link</a>

